# data integrity check

## 1. Connect to the database:

In [63]:
import pandas as pd
import sqlite3
con = sqlite3.connect("data/db/food_inspections.db")

In [64]:
facility_test = pd.read_sql_query('select * from facility limit 5;', con)
facility_test

,id,name_dba,name_aka,license_id,facility_type,address,zip
0,0,#1 CHINA EXPRESS LTD,#1 CHINA EXPRESS LTD,1869616,restaurant,4248 S WENTWORTH AVE,60609
1,1,#1 CHOP SUEY,#1 CHOP SUEY,2042372,restaurant,1907 W 87TH ST,
2,2,#1 CHOP SUEY,#1 CHOP SUEY,1970042,restaurant,4307 W IRVING PARK RD,60641
3,3,#1 CHOP SUEY RESTAURANT,#1 CHOP SUEY RESTAURANT,1739799,restaurant,4307 W IRVING PARK RD,60641
4,4,#1 DELI INC,31 DELI INC,2501188,grocery,6901 S NORMAL BLVD,60621

In [65]:
address_test = pd.read_sql_query('select * from address limit 5;', con)
address_test

                     street    zip     city state   latitude  longitude
0        2121 S PRAIRIE AVE  60616  CHICAGO    IL  41.853651 -87.620534
1         1025 W MADISON ST  60607  CHICAGO    IL  41.881572 -87.653052
2          301 N JUSTINE ST  60607  CHICAGO    IL  41.886577 -87.665328
3       2245 N MCVICKER AVE  60639  CHICAGO    IL  41.921675 -87.776711
4  4355 S COTTAGE GROVE AVE  60653  CHICAGO    IL  41.815197 -87.606531

In [66]:
risk_test = pd.read_sql_query('select * from risk limit 5;', con)
risk_test

  code   level
0    0     All
1    1    High
2    2  Medium
3    3     Low

In [67]:
facility_risk_test = pd.read_sql_query('select * from facility_risk limit 5;', con)
facility_risk_test

  facility_id risk_code
0           0         1
1           1         1
2           2         1
3           3         1
4           4         2

In [68]:
inspection_test = pd.read_sql_query('select * from inspection limit 5;', con)
inspection_test

      id        date                   type result
0  67732  2010-01-04  license re-inspection   Pass
1  67733  2010-01-04  license re-inspection   Pass
2  52234  2010-01-04  license re-inspection   Pass
3  67757  2010-01-04            tag removal   Pass
4  70269  2010-01-04  license re-inspection   Pass

In [69]:
facility_inspection_test = pd.read_sql_query('select * from facility_inspection limit 5;', con)
facility_inspection_test

  facility_id inspection_id
0           0        467259
1           0       1285263
2           1       1296904
3           1       1395782
4           1        277104

In [70]:
violation_test = pd.read_sql_query('select * from violation limit 5;', con)
violation_test

  code                                        description
0    1  SOURCE SOUND CONDITION, NO SPOILAGE, FOODS PRO...
1    2          FACILITIES TO MAINTAIN PROPER TEMPERATURE
2    3  POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE R...
3    4  SOURCE OF CROSS CONTAMINATION CONTROLLED I.E. ...
4    5  PERSONNEL WITH INFECTIONS RESTRICTED: NO OPEN ...

In [71]:
inspection_violation_test = pd.read_sql_query('select * from inspection_violation limit 5;', con)
inspection_violation_test

,inspection_id,violation_code,violation_comment
0,44247,30,All food not stored in the original container ...
1,44247,32,OBSERVED TORN DOOR GASKET ON DOOR OF 'CHILL IS...
2,44247,33,All food and non-food contact surfaces of equi...
3,44247,34,"The floors shall be constructed per code, be s..."
4,44247,37,Toilet rooms shall be completely enclosed and ...

## 2. Comparison and Integrity Check

This section compares the cleaned data with the original data.

load the original data

In [72]:
orig_data = pd.read_csv("data/original/Food_Inspections.csv")
orig_data.head()

,Inspection ID,DBA Name,AKA Name,License #,Facility Type,Risk,Address,City,State,Zip,Inspection Date,Inspection Type,Results,Violations,Latitude,Longitude,Location
0,2079132,MARRIOT MARQUIS CHICAGO,MARRIOT MARQUIS CHICAGO,2517328.0,Restaurant,Risk 1 (High),2121 S PRAIRIE AVE,CHICAGO,IL,60616.0,08/28/2017,License,Pass,NaN,41.853651,-87.620534,"(41.853650885040594, -87.62053358114167)"
1,2079129,JET'S PIZZA,JET'S PIZZA,2522268.0,Restaurant,Risk 2 (Medium),1025 W MADISON ST,CHICAGO,IL,60607.0,08/28/2017,License,Not Ready,NaN,41.881572,-87.653052,"(41.88157249576794, -87.65305233593274)"
2,2079125,ROOM 1520,ROOM 1520,2446638.0,Special Event,Risk 3 (Low),301 N JUSTINE ST,CHICAGO,IL,60607.0,08/28/2017,License Re-Inspection,Not Ready,8. SANITIZING RINSE FOR EQUIPMENT AND UTENSILS...,41.886577,-87.665328,"(41.88657652150854, -87.66532812140231)"
3,2079123,MARRIOT MARQUIS CHICAGO,MARRIOT MARQUIS CHICAGO,2517338.0,Restaurant,Risk 1 (High),2121 S PRAIRIE AVE,CHICAGO,IL,60616.0,08/28/2017,License,Pass,"35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTR...",41.853651,-87.620534,"(41.853650885040594, -87.62053358114167)"
4,2079105,CHARTWELLS,CICS WEST BELDEN CAMPUS,2549079.0,CHARTER SCHOOL,Risk 1 (High),2245 N MCVICKER AVE,CHICAGO,IL,60639.0,08/28/2017,License Re-Inspection,Pass,18. NO EVIDENCE OF RODENT OR INSECT OUTER OPEN...,41.921675,-87.776711,"(41.921675488910864, -87.7767113569357)"

### 1. Address Integrity Check
#### 1. City
The original data have un-uniformed format , and have lots of invalid city names such as 'CCHICAGO', 'CHICAGOCHICAGO', 'CHCHICAGO', 'CHICAGOI', 'CHCICAGO', '312CHICAGO'.

In [73]:
address_city_original = orig_data['City'].value_counts()
address_city_original

CHICAGO                 153090
Chicago                    258
chicago                     77
CCHICAGO                    39
SCHAUMBURG                  18
MAYWOOD                     14
ELK GROVE VILLAGE           12
CHicago                     10
SKOKIE                       8
INACTIVE                     8
CHESTNUT STREET              8
EVANSTON                     7
CICERO                       6
CHICAGOCHICAGO               6
CHCHICAGO                    6
CHARLES A HAYES              6
WORTH                        5
ELMHURST                     5
OAK PARK                     4
CALUMET CITY                 4
SUMMIT                       4
EAST HAZEL CREST             3
ALSIP                        3
CHICAGOI                     3
NILES NILES                  3
CHCICAGO                     3
SCHILLER PARK                3
CHICAGO HEIGHTS              2
BERWYN                       2
BLUE ISLAND                  2
STREAMWOOD                   2
NAPERVILLE                   2
312CHICAGO                   2
BEDFORD PARK                 2
BANNOCKBURNDEERFIELD         2
BROADVIEW                    1
LAKE ZURICH                  1
FRANKFORT                    1
Maywood                      1
GLENCOE                      1
LAKE BLUFF                   1
OAK LAWN                     1
alsip                        1
OLYMPIA FIELDS               1
BLOOMINGDALE                 1
DES PLAINES                  1
BURNHAM                      1
Norridge                     1
BOLINGBROOK                  1
COUNTRY CLUB HILLS           1
LOMBARD                      1
TINLEY PARK                  1
JUSTICE                      1
WESTMONT                     1
OOLYMPIA FIELDS              1
BRIDEVIEW                    1
EVERGREEN PARK               1
Name: City, dtype: int64

The cleaned city column have uniform upper case format.
And invalid city names are cleaned.

In [74]:
address_city_integrity = pd.read_sql_query('select city from address where city != "" group by city;', con)
address_city_integrity

                    city
0                  ALSIP
1   BANNOCKBURNDEERFIELD
2                 BERWYN
3           BLOOMINGDALE
4            BLUE ISLAND
5            BOLINGBROOK
6              BRIDEVIEW
7              BROADVIEW
8           CALUMET CITY
9                CHICAGO
10       CHICAGO HEIGHTS
11                CICERO
12    COUNTRY CLUB HILLS
13           DES PLAINES
14      EAST HAZEL CREST
15     ELK GROVE VILLAGE
16              ELMHURST
17              EVANSTON
18        EVERGREEN PARK
19             FRANKFORT
20               GLENCOE
21               JUSTICE
22            LAKE BLUFF
23           LAKE ZURICH
24               LOMBARD
25               MAYWOOD
26            NAPERVILLE
27           NILES NILES
28              NORRIDGE
29              OAK LAWN
30              OAK PARK
31        OLYMPIA FIELDS
32            SCHAUMBURG
33         SCHILLER PARK
34                SKOKIE
35            STREAMWOOD
36                SUMMIT
37           TINLEY PARK
38                 WORTH

#### 2. Duplicate address for the same location

In the original data, there are different variations of addresses for the same location (latitude & longitude) and city/state/zip:

In [75]:
temp = orig_data[['Address', 'Latitude', 'Longitude']].drop_duplicates()
address_duplicated_original = temp.groupby(
    by=['Latitude', 'Longitude'], dropna=False)\
    .filter(lambda x: len(x) > 1).sort_values(by=['Latitude', 'Address'], ascending=False)

address_duplicated_original
#with pd.option_context('display.max_rows', None, 'display.max_columns', None):
#    display(address_duplicated)

                      Address   Latitude  Longitude
115964      1636 W Howard ST   42.019491 -87.672224
6882        1636 W HOWARD ST   42.019491 -87.672224
83917     1632 W howard BLDG   42.019490 -87.672057
25889       1632 W HOWARD ST   42.019490 -87.672057
77277      7410 N clark BLDG   42.016328 -87.675398
...                       ...        ...        ...
37884     12201 S HALSTED ST   41.672270 -87.641576
136481    12760 S Halsted ST   41.661467 -87.641508
69411     12760 S HALSTED ST   41.661467 -87.641508
100604  13703 S Indiana BLDG   41.646554 -87.617083
100601   13703 S INDIANA AVE   41.646554 -87.617083

[1883 rows x 3 columns]

The cleaned data shall have unique address, latitude and longitude. The following query checks if we can duplicated addresses.

In [76]:
address_count_cleaned = pd.read_sql_query\
    ('select street, latitude, longitude, count(*) from address where street != "" group by street, latitude, longitude  having count(*) > 1;', con)
address_count_cleaned

Empty DataFrame
Columns: [street, latitude, longitude, count(*)]
Index: []

#### 3. City Inference

In the original data, same latitude and longitude have conflict city names.
- Some locations have a certain city and "NaN". We inferred the missing NaN value for this scenario.
- For Some locations that have conflict city names. We chose the one with a higher count.
We inferred the missing NaN

In [77]:
temp = orig_data.groupby(by=['Latitude', 'Longitude', 'City'], dropna=False).size().rename('count').reset_index()
duplicated_city = temp.groupby(by=['Latitude', 'Longitude'], dropna=False)\
    .filter(lambda x: len(x) > 1).sort_values(by=['Latitude', 'Longitude', 'count'], ascending=False)
duplicated_city

        Latitude  Longitude      City  count
15705  42.008536 -87.914428   CHICAGO   1874
15706  42.008536 -87.914428       NaN     10
15299  41.997452 -87.687581   CHICAGO      3
15300  41.997452 -87.687581  CHICAGOI      3
14856  41.985066 -87.668949   CHICAGO     11
...          ...        ...       ...    ...
1719   41.751592 -87.568606       NaN      1
1629   41.751030 -87.613649   CHICAGO      5
1630   41.751030 -87.613649       NaN      1
1426   41.746236 -87.643766       NaN     12
1425   41.746236 -87.643766   CHICAGO      1

[90 rows x 4 columns]

The cleaned data shows no duplicates:

In [78]:
city_count_cleaned = pd.read_sql_query\
    ('select city, latitude, longitude, count(*) from address where street != "" group by street, latitude, longitude  having count(*) > 1;', con)
city_count_cleaned

Empty DataFrame
Columns: [city, latitude, longitude, count(*)]
Index: []